Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управленческий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерческий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	Если СтрокаРасчета.Сумма <> Неопределено
			И СтрокаРасчета.СуммаНДС <> Неопределено Тогда
		СтрокаРасчета.Всего = СтрокаРасчета.Сумма + СтрокаРасчета.СуммаНДС;
	КонецЕсли;	
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтавкаЧисло = ПолучитьСтавку(СтрокаРасчета.СтавкаНДС);
	СтрокаРасчета.СуммаНДС = СтрокаРасчета.Сумма * СтавкаЧисло;
	ТоварыСуммаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьСтавку(СтавкаНДС)
	Возврат СтавкаНДС.Ставка / 100;
КонецФункции
 
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыКоличествоЦенаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	Если СтрокаРасчета.Цена <> Неопределено 
			И СтрокаРасчета.Количество <> Неопределено Тогда
		СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	КонецЕсли;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.СтавкаНДС = ПолучитьСтавкуТовара(СтрокаРасчета.Номенклатура);
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПолучитьСтавкуТовара(Товар)
    Возврат Товар.НДС;
КонецФункции
